KASTORPROJECT/src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <attributes>
    <name>АдресПубликации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипБазы</name>
    <type>
      <types>EnumRef.ТипыИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>CatalogRef.Сервера</types>
    </type>
  </attributes>
  <attributes>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКБазе</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

KASTORPROJECT/src/CommonModules/адм_Интеграция/Module.bsl
#Область СлужебныеПроцедурыИФункции
Функция V83ПодключитьБазу(ИнформационнаяБазаСсылка , СообщениеОбОшике) Экспорт
	
	Попытка
		Соединение = Новый COMObject("V83.COMConnector");
		СтруктураПодключения = Новый Структура("Сервер, База, Пользователь, Пароль");
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ИнформационныеБазы.Сервер.Наименование КАК Сервер,
		|	ИнформационныеБазы.ПутьКБазе КАК База,
		|	""ext_exchange"" КАК Пользователь,
		|	""ext1_3exchange6"" КАК Пароль
		|ИЗ
		|	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
		|ГДЕ
		|	ИнформационныеБазы.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ИнформационнаяБазаСсылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(СтруктураПодключения,ВыборкаДетальныеЗаписи );
		Иначе
			СообщениеОбОшике = "Не найдены параметры для подключения к базе 1С: " + ИнформационнаяБазаСсылка.Наименование;
			БазаCom = Неопределено ;
			Возврат БазаCom;
		КонецЕсли;
		
		СтрокаПодключения = "Srvr = """ + СтруктураПодключения.Сервер + """; Ref = """ + СтруктураПодключения.База + 
		"""; Usr=""" + СтруктураПодключения.Пользователь +  """;Pwd=""" + СтруктураПодключения.Пароль + """";
		
		Попытка
			БазаCom = Соединение.Connect(СтрокаПодключения);			
		Исключение
			СообщениеОбОшике = "Ошибка подключения к базе 1С: " + ИнформационнаяБазаСсылка.Наименование + ". " +  ОписаниеОшибки();
			БазаCom = Неопределено ;
		КонецПопытки;
		
	Исключение
		СообщениеОбОшике = "Ошибка подключения к базе 1С: " + ИнформационнаяБазаСсылка.Наименование + ". " +  ОписаниеОшибки();
		БазаCom = Неопределено ;
	КонецПопытки;
	
	Возврат БазаCom;
	
КонецФункции // ()

#КонецОбласти
